package com.theopus.parser.obj.table;

import org.junit.Test;

import static org.junit.Assert.*;

public class SimpleTableTest {

    private String pdf = "< КТОУП > 2 жовтня 2017\n" +
            " академгрупа КН-11\n" +
            "===========================================================================\n" +
            "Тиждень|Понедiл|Вiвторо|Середа |Четвер |П'ятниц|Субота | Сума |Вiкна | Днi\n" +
            "===========================================================================\n" +
            " 6.10|░░░░░░░|░░░░░░░|░░░░░░░|░░░░░░░|ППл....|.......| 6 | - | 1\n" +
            " 9.10|.лЛП...|ЛППП...|ЛЛЛ....|Л.Л....|лП.....|.......| 28 | 1 | 5\n" +
            " 16.10|ПлЛП...|ЛлПП...|ЛЛЛ....|ЛПЛ....|ПП.....|.......| 32 | - | 5\n" +
            " 23.10|.лЛП...|ЛПлП...|.ЛЛ....|ЛПЛ....|лП.....|.......| 28 | - | 5\n" +
            " 30.10|.лЛП...|ЛППП...|ЛЛЛП...|Л.Л....|лл.....|.......| 30 | 1 | 5\n" +
            " 6.11|.лПП...|ЛППП...|ЛЛЛ....|ЛлЛ....|Пл.....|.......| 30 | - | 5\n" +
            " 13.11|ллПП...|ЛППП...|ЛЛЛ....|Л.П....|лл.....|.......| 30 | 1 | 5\n" +
            " 20.11|.лПП...|ЛППП...|ПЛЛ....|ЛлП....|лл.....|.......| 30 | - | 5\n" +
            " 27.11|.лПП...|.ППП...|.лЛ....|.ПП....|лл.....|.......| 24 | - | 5\n" +
            " 4.12|.ПЛП...|.ППП...|.лЛ....|.ППП...|лл.....|.......| 26 | - | 5\n" +
            " 11.12|.ПЛП...|.ППП...|.лЛ....|.ПП....|░░░░░░░|░░░░░░░| 20 | - | 4\n" +
            " Всього 284 | 3 | 50\n" +
            "===========================================================================\n" +
            " Понедiлок\n" +
            "---------------------------------------------------------------------------\n" +
            "9:00 Вища математика (Практ.з.); [16.10 ауд.349] ас. Мартинюк О.Г.\n" +
            "--\"-- Мультимедiйнi iнформ. технологii (лабор.з.); [13.11 ауд.459]\n" +
            " доц. Котетунов В.Ю.\n" +
            "10:30 Iнформ. офiснi технологii (лабор.з.); [до 27.11 ауд.374]\n" +
            " доц. Киiвська К.I.\n" +
            "--\"-- Вища математика (Практ.з.); [4.12, 11.12 ауд.349] ас. Мартинюк О.Г.\n" +
            "12:20 Iнженерна графiка (Лекцiї); [до 30.10 ауд.413] проф. Анпiлогова В.О.\n" +
            "--\"-- Вища математика (Практ.з.); [з 6.11 до 27.11 ауд.349]\n" +
            " ас. Мартинюк О.Г.\n" +
            "--\"-- Вища математика (Лекцiї); [4.12, 11.12 ауд.360]\n" +
            " зав.каф. Михайленко В.М.\n" +
            "13:50 Iнженерна графiка (Практ.з.); [ ауд.413] проф. Анпiлогова В.О.\n" +
            "---------------------------------------------------------------------------\n" +
            " Вiвторок\n" +
            "---------------------------------------------------------------------------\n" +
            "9:00 Алгоритмiзацiя та програмування (Лекцiї); [до 21.11 ауд.347]\n" +
            " доц. Горда О.В.\n" +
            "10:30 Вища математика (Практ.з.); [10.10, 24.10, 31.10, з 28.11 ауд.349]\n" +
            " ас. Мартинюк О.Г.\n" +
            "--\"-- Фiзика (лабор.з.); [17.10 ауд.473] доц. Азнаурян I.О.,\n" +
            " ас. Кузнецова I.O.\n" +
            "--\"-- Фiзична виховання (Практ.з.); [з 7.11 до 21.11]\n" +
            "12:20 Вища математика (Практ.з.); [10.10, з 31.10 до 21.11 ауд.349]\n" +
            " ас. Мартинюк О.Г.\n" +
            "--\"-- Фiзична виховання (Практ.з.); [17.10]\n" +
            "--\"-- Фiзика (лабор.з.); [24.10 ауд.473] доц. Азнаурян I.О.,\n" +
            " ас. Кузнецова I.O.\n" +
            "--\"-- Iсторiя укр.держ.та культури (Практ.з.); [з 28.11 ауд.352]\n" +
            " доц. Савойська С.В.\n" +
            "13:50 Iсторiя укр.держ.та культури (Практ.з.); [до 24.10 ауд.351]; [з 31.10\n" +
            " ауд.358] доц. Савойська С.В.\n" +
            "---------------------------------------------------------------------------\n" +
            " Середа\n" +
            "---------------------------------------------------------------------------\n" +
            "9:00 Мультимедiйнi iнформ. технологii (Лекцiї); [11.10, 18.10,\n" +
            " з 1.11 до 15.11 ауд.347] ст.викл. Гончаренко Т.А.\n" +
            "--\"-- Алгоритмiзацiя та програмування (Практ.з.); [22.11 ауд.374]\n" +
            " ас. Пороховнiченко I.A.\n" +
            "10:30 Фiзика (Лекцiї); [до 22.11 ауд.473] доц. Азнаурян I.О.\n" +
            "--\"-- Фiзика (лабор.з.); [з 29.11 ауд.473] доц. Азнаурян I.О.,\n" +
            " ас. Кузнецова I.O.\n" +
            "12:20 Вища математика (Лекцiї); [ ауд.360] зав.каф. Михайленко В.М.\n" +
            "13:50 Алгоритмiзацiя та програмування (Практ.з.); [1.11 ауд.371]\n" +
            " ас. Пороховнiченко I.A.\n" +
            "---------------------------------------------------------------------------\n" +
            " Четвер\n" +
            "---------------------------------------------------------------------------\n" +
            "9:00 Iсторiя укр.держ.та культури (Лекцiї); [до 23.11 ауд.351]\n" +
            " доц. Савойська С.В.\n" +
            "10:30 Вища математика (Практ.з.); [ ауд.358]; [19.10 ауд.349]\n" +
            " ас. Мартинюк О.Г.\n" +
            "--\"-- Фiзична виховання (Практ.з.); [26.10, з 30.11]\n" +
            "--\"-- Фiзика (лабор.з.); [9.11, 23.11 ауд.473] доц. Азнаурян I.О.,\n" +
            " ас. Кузнецова I.O.\n" +
            "12:20 Iнформ. офiснi технологii (Лекцiї); [до 9.11 ауд.360]\n" +
            " доц. Киiвська К.I.\n" +
            "--\"-- Iнформ. офiснi технологii (Практ.з.); [з 16.11 ауд.374]\n" +
            " доц. Киiвська К.I.\n" +
            "13:50 Iнформ. офiснi технологii (Практ.з.); [7.12 ауд.374]\n" +
            " доц. Киiвська К.I.\n" +
            "---------------------------------------------------------------------------\n" +
            " П'ятниця\n" +
            "---------------------------------------------------------------------------\n" +
            "9:00 Мультимедiйнi iнформ. технологii (Практ.з.); [6.10, 20.10 ауд.459]\n" +
            " доц. Котетунов В.Ю.\n" +
            "--\"-- Мультимедiйнi iнформ. технологii (лабор.з.); [13.10, 27.10, 3.11,\n" +
            " 17.11, 24.11 ауд.459] доц. Котетунов В.Ю.\n" +
            "--\"-- Алгоритмiзацiя та програмування (Практ.з.); [10.11 ауд.366]\n" +
            " ас. Пороховнiченко I.A.\n" +
            "--\"-- Iнформ. офiснi технологii (лабор.з.); [1.12, 8.12 ауд.374]\n" +
            " доц. Киiвська К.I.\n" +
            "10:30 Фiзична виховання (Практ.з.); [6.10, 27.10]\n" +
            "--\"-- Алгоритмiзацiя та програмування (Практ.з.); [13.10 ауд.371]\n" +
            " ас. Пороховнiченко I.A.\n" +
            "--\"-- Вища математика (Практ.з.); [20.10 ауд.349] ас. Мартинюк О.Г.\n" +
            "--\"-- Алгоритмiзацiя та програмування (лабор.з.); [ ауд.374]; [\n" +
            " з 3.11 до 24.11 ауд.459] ас. Пороховнiченко I.A.\n" +
            "--\"-- Мультимедiйнi iнформ. технологii (лабор.з.); [1.12, 8.12 ауд.459]\n" +
            " доц. Котетунов В.Ю.\n" +
            "12:20 Алгоритмiзацiя та програмування (лабор.з.); [6.10 ауд.368]\n" +
            " ас. Пороховнiченко I.A.\n" +
            "-------------------------------------------------------------------";

    @Test
    public void test() throws Exception {

    }
}